import "./privacy.css";
import ToolBar from "../../components/toolbar/toolbar";
import Accordion from "react-bootstrap/Accordion";

function Privacy() {
  return (
    <div style={{ margin: "0 250px" }}>
      <ToolBar />
      <Accordion defaultActiveKey="0" style={{ marginTop: "100px" }}>
        <Accordion.Item eventKey="0">
          <Accordion.Header>이용약관</Accordion.Header>
          <Accordion.Body>
            제1조 (목적) 이 약관은 디깅 (이하 "회사"라 한다) 에서 제공하는
            서비스를 이용함에 있어 이용자의 권리,의무 및 책임사항을 규정함을
            목적으로 합니다. 제2조(회원가입) ① 이용자는 "회사" 에서 정한 양식에
            따라 개인정보를 기입 한 후 이 약관에 동의한다는 의사표시를 함으로서
            구매 및 "회사" 의 특정 서비스 이용을 신청합니다. ② "회사"는 제1항과
            같이 이용자로 가입할 것을 신청한 자 중 다음 각호에 해당하지 않는 한
            이용자로 등록합니다. 가입신청자가 이 약관 제3조 제3항에 의하여
            이전에 자격을 상실한 적이 있는 경우, 다만 제3조 제3항에 의한 자격
            상실후 3년이 경과한 자로서 "회사"의 재가입 승낙을 얻은 경우에는
            예외로 한다. 1)등록 내용에 허위, 기재누락, 오기가 있는 경우 2)기타
            이용자로 등록하는 것이 "회사"의 기술상 현저히 지장이 있다고 판단되는
            경우 3)제조물에 대한 책임 4)만 14세가 되지 않은 자가 신청하였을
            경우. 단, 법정대리인의 동의가 있는 경우에는 회원가입이 가능
            ③가입계약의 성립시기는 "회사"의 승낙이 이용자에게 도달한 시점으로
            합니다. ④이용자는 제4조 제1항에 의한 등록사항에 변경이 있는 경우,
            즉시 전자우편 기타 방법으로 "회사"에 대하여 그 변경사항을 알려야
            합니다. 제3조(가입 탈퇴 및 자격 상실 등) ①이용자는 "회사"에 언제든지
            탈퇴를 요청할 수 있으며 "회사"는 즉시 탈퇴를 처리합니다. ②이용자가
            다음 각호의 사유에 해당하는 경우, "회사"는 이용자자격을
            제한,판매거부 및 정지 시킬 수 있습니다. 1)가입 신청시에 허위 내용을
            등록한 경우 2)"회사"를 이용하여 구입한 재화·용역 등의 대금,기타
            "회사"이용 관련 이용자 부담 채무를 기일에 지급하지 않는 경우 3)다른
            사람의 "회사" 이용을 방해하거나 그 정보를 도용하는 등 전자거래질서를
            위협하는 경우 4)회사를 이용하여 법령과 이 약관이 금지하거나
            미풍양속에 반하는 행위를 하는 경우 5)고객센터 등 회사의 제반
            상담창구 이용시 욕설,반말,협박,위해 및 성적비하가 담긴 글이나
            비정상적,비인격적 언행을 표출 하는 경우 6)제반 상담창구 이용시
            신속해결 위한 전화상담 거부,회피 상태에서 반복적,다량의 문의접수
            또는, 답변이 종결된 동일 문의를 다량접수 하는 등 업무방해 행위를
            하는 경우 7)구매 후 상품에 특별한 하자가 없는데도 불구하고, 일부
            사용 후 상습적으로 전부 또는 일부를 반품, '회사'이 이용자를 위해
            시행하는 각종의 이벤트(할인쿠폰, 포인트적립)를 서비스 제공목적에
            맞지 않도록 사용하는 행위, 구매 후 장기간 출고보류 요청(2일 이상)
            등으로 다른 이용자의 구매기회 박탈, 중고 물류시스템에 악영향을
            끼치는 구매, 반품 행태를 2회 이상의 협조,경고 요청에도 불구하고
            지속하는 경우 8)회원이 1년 동안 회사를 이용하지 않았을 경우 원활한
            회원관리를 위하여 휴면계정으로 처리하여 회원자격으로의 활동과 해당
            계정으로 지급된 일체의 적립금 등의 사용을 제한 할 수 있습니다. *
            아래와 같은 '회사 이용 없음' 조건이 동시에 충족될 경우에 휴면계정
            처리 대상입니다. - 1년 이상 미거래 및 로그인 이력 없는 경우 * 다만,
            회원이 회사가 정한 절차에 따라 휴면계정 철회를 요청하면 회사는
            종전의 회원자격과 적립금을 다시 활성화하여야 합니다. * 휴면계정으로
            처리된 후 일정기간이 지나면 회사는 제3조에 정한 방법으로 통지 후
            해당 회원의 적립금을 소멸할 수 있습니다. 제4조 (개인정보보호)
            "회사"는 이용자의 정보수집시 구매계약 이행에 필요한 최소한의 정보를
            수집합니다. "정보통신망이용촉진및정보보호에관한법률" 등 관계 법령이
            정하는 바에 따라 "회원"의 개인정보를 보호하기 위해 노력합니다.
            개인정보의 보호 및 활용에 대해서는 관련법 및 "회사"의
            "개인정보취급방침"이 적용됩니다. 다만, "회사"의 공식 사이트 이외의
            링크된 사이트에서는 "회사"의 개인정보취급방침이 적용되지 않습니다.
            또한 “회사”는 회원의 귀책사유로 인해 노출된 정보에 대해서 일체의
            책임을 지지 않습니다 제5조 (약관의 명시와 개정) "회사"는 이용자께서
            알라딘의 개인정보보호방침 또는 이용약관의 내용에 대해
            「동의한다」버튼 또는 「동의하지 않는다」버튼을 클릭할 수 있는
            절차를 마련하여, 「동의한다」버튼을 클릭하면 개인정보 수집에 대해
            동의한 것으로 봅니다. ①"회사"는 이 약관의 내용과을 이용자가 알 수
            있도록 초기 서비스 화면에 게시합니다. ②"회사"는
            약관의규제에관한법률, 전자거래기본법, 전자서명법,
            정보통신망이용촉진등에관한법률, 방문판매등에관한법률, 소비자보호법
            등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
            ③"회사"가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여
            현행약관과 함께 몰의 초기화면에 그 적용일자 7일 이전부터 적용일자
            전일까지 공지합니다. ④"회사"가 약관을 개정할 경우에는 그 개정약관은
            그 적용일자 이후에 체결되는 계약에만 적용되고 그 이전에 이미 체결된
            계약에 대해서는 개정전의 약관조항이 그대로 적용됩니다. 다만 이미
            계약을 체결한 이용자가 개정약관 조항의 적용을 받기를 원하는 뜻을
            제3항에 의한 개정약관의 공지기간내에 '회사"에 송신하여 "회사"의
            동의를 받은 경우에는 개정약관 조항이 적용됩니다. ⑤이 약관에서 정하지
            아니한 사항과 이 약관의 해석에 관하여는 정부가 제정한
            전자거래소비자보호지침 및 관계법령 또는 상관례에 따릅니다. 제6조
            (서비스) ① 서비스 이용자의 편의성을 높이기 위해 일부 서비스 내지
            기능에 대하여 유상으로 서비스를 제공 할 수 있습니다. ② "회사"는
            오프라인 서비스의 대상인 배송 및 직거래 상품의 품질이나 상태에
            대하여 보증하지 아니하며, 하자 등 상품의 어떠한 점에 대해서도 알 수
            없다는 점을 명확히 합니다. 오프라인 서비스 이용과 관련하여
            이용자에게 손해가 발생한 경우, "회사"는 이용자에 대한 손해배상 등
            책임을 부담하지 않습니다. ③ "회사" 서비스는 컴퓨터 등 보수점검,교체
            및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공이
            일시적으로 중단 될 수 있습니다. 서비스 중단의 경우 사전에 통지를
            원칙으로 하나, 예측할 수 없는 사유로 인한 서비스 중단의 경우 사후에
            공지합니다. "회사"의 고의 또는 과실이 없는 경우 서비스 중단으로 인한
            제3자의 손해에 대하여 배상하지 않습니다. 제7조 (이용자의 의무)
            이용자는 다음 행위를 하여서는 안됩니다. 1)신청 또는 변경시
            허위내용의 등록 2)"회사"에 게시된 정보의 변경 3)"회사"가 정한 정보
            이외의 정보(컴퓨터 프로그램 등)의 송신 또는 게시 4)"회사" 및 기타
            제3자의 저작권 등 지적재산권에 대한 침해 5)"회사" 및 기타 제3자의
            명예를 손상시키거나 업무를 방해하는 행위 6)외설 또는 폭력적인
            메시지·화상·음성 기타 미풍양속에 반하는 정보를 몰에 공개 또는
            게시하는 행위
          </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item eventKey="1">
          <Accordion.Header>개인정보처리방침</Accordion.Header>
          <Accordion.Body>
            디깅(이하 회사)는 ｢개인정보 보호법｣에 따라 이용자의 개인정보를
            보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기
            위하여 다음과 같이 개인정보 처리방침을 수립 및 공개합니다. 제1조
            (개인정보의 처리목적) 회사는 다음의 목적을 위하여 개인정보를
            처리하며, 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는
            이용되지 않습니다. 이용 목적이 변경되는 경우에는 ｢개인정보 보호법｣에
            따라 별도의 동의를 받는 등 필요한 조치를 이행 할 예정입니다. ① 회원
            가입 및 관리 회원 가입의사 확인과 회원제 서비스 제공에 따른 회원자격
            유지 및 관리, 서비스 부정이용 방지, 각종 고지와 통지, 고충처리
            목적으로 개인정보를 처리합니다. ② 서비스 제공 서비스 및 콘텐츠,
            광고를 포함한 맞춤형 서비스 제공을 목적으로 개인정보를 처리합니다. ③
            고충처리 이용자의 신원 확인, 문의사항 확인, 사실조사를 위한 연락,
            통지, 처리결과 통보의 목적으로 개인정보를 처리합니다. 제2조
            (개인정보의 처리 및 보유기간) 회사는 법령에 명시되어 있거나
            이용자로부터 개인정보 수집 시 동의 받은 개인정보의 보유 및 이용기간
            내에서 개인정보를 처리 및 보유합니다. 각각의 개인정보 처리 및 보유
            기간은 다음과 같습니다. 법정대리인의 동의가 필요한 만14세 미만
            아동에 대한 정보를 수집 및 이용하지 않습니다. ① 회원 가입 및 관리:
            회원 탈퇴 시까지 다만, 다음의 사유에 해당하는 경우에는 해당 사유
            종료 시까지 1) 관계 법령 위반에 따른 수사, 조사 등이 진행 중인
            경우에는 해당 수사, 조사 종료 시까지 2) 서비스 이용에 따른 채권,
            채무관계 잔존 시에는 해당 채권, 채무관계 정산 시까지 ② 서비스 제공:
            서비스 공급 완료 또는 서비스 이용 종료 시까지 다만, 다음의 사유에
            해당하는 경우에는 내부 기준에 따른 보관기간 종료 시까지 1) 부정이용
            방지를 위해 정보(이름, 이메일(로그인ID), 휴대전화번호, CI/DI): 3년
            2) 이벤트 진행 및 경품 배송, 제세공과금 처리를 위해 정보 (이름,
            주소, 휴대전화번호): 3개월 3) 거래처 등록 및 대금 지급을 위한 정보
            (거래처 등록서류, 입금계좌 정보): 정보 확인 및 거래처 등록 후 3개월
            ③ 고충처리: 고충 처리 완료 시까지 다만, 다음의 사유에 해당하는
            경우에는 해당 기간 종료 시까지 1) 통신비밀보호법 - 서비스 이용 관련
            정보(접속로그) : 3개월 2) 전자상거래 등에서의 소비자 보호에 관한
            법률 - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년 - 계약 또는
            청약철회 등에 관한 기록 : 5년 - 대금결제 및 재화 등의 공급에 관한
            기록 : 5년 제3조 (개인정보 제3자 제공에 관한 사항) 회사는 이용자들의
            개인정보를 "개인정보의 수집목적 및 이용목적"에서 고지한 범위 내에서
            사용하며, 이용자의 사전 동의 없이는 동 범위를 초과하여 이용하거나
            원칙적으로 이용자의 개인정보를 외부에 공개하지 않습니다. 다만,
            아래의 경우에는 예외로 합니다. 또한 예외적인 사유 등으로
            개인위치정보를 제3자에게 제공하는 경우, 제공받는 자, 제공일시 및
            제공목적을 이용자에게 전자우편 또는 팝업 등의 방법으로 즉시
            통보합니다. ① 이용자의 동의가 있는 경우 개인정보 제3자 제공 현황 1)
            회사에서 이용자에게 서비스를 제공하는 감별 회사 2) 디깅 판매자 ②
            관련 법령에 따른 제공 회사는 개인정보보호법 등 관계 법령이 정하는
            경우, 그 밖에 정부 관계부처가 합동으로 발표한 「긴급상황 시 개인정보
            처리 및 보호수칙」에 따라 재난, 감염병, 급박한 생명·신체 위험을
            초래하는 사건·사고, 급박한 재산 손실 등의 긴급상황이 발생하는 경우,
            정보주체의 동의 없이 관계기관에 개인정보를 제공할 수 있습니다. 제4조
            (개인정보 파기 절차 및 방법) 이용자의 개인정보는 수집 및 이용목적이
            달성되면 지체없이 파기합니다.(여기서 ‘이용목적이 달성된 때’란
            철회요청, 서비스계약 만료, 탈퇴 시를 의미.) 다만, 회사 내부 방침
            또는 관계 법령에서 정한 보관기간이 있을 경우 일정 기간동안 보관 후
            파기 됩니다. 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각하여
            파기하고, 전자적 파일 형태로 저장된 기록은 재생할 수 없는 기술적
            방법을 사용하여 삭제합니다. 회사는 이용고객의 민원처리 등을 위해
            위치정보 수집/이용/제공 사실 확인자료를 자동 기록·보존 하며, 해당
            자료는 6개월간 보관 후 파기합니다. 제5조 (개인정보 안전성 확보
            조치에 관한 사항) 「개인정보보호법」 제29조에 따라 다음과 같이
            안전성 확보에 필요한 기술적, 관리적, 물리적 보호대책을 수립하여
            운영하고 있습니다. ① 개인정보 취급자의 최소화 및 교육 개인정보를
            처리하는 직원을 최소화 하며, 개인정보를 처리하는 모든 임직원들을
            대상으로 개인정보보호 의무와 보안에 대한 정기적인 교육과 캠페인을
            실시 ② 개인정보에 대한 접근 제한 - 개인정보를 처리하는 시스템에 대한
            접근권한의 부여, 변경, 말소 절차 수립 및 운영 - 침입탐지시스템을
            이용하여 외부로부터의 무단 접근 통제 ③ 접속기록의 보관 및 위변조
            방지 - 개인정보처리시스템에 접속한 기록(웹 로그, 요약정보 등)을 최소
            2년 이상 보관 및 관리 - 접속 기록이 위변조 및 도난, 분실되지 않도록
            보안기능 사용 ④ 개인정보의 암호화 - 신용카드 번호 등 중요정보는
            암호화 되어 저장 및 관리 - 중요한 데이터는 저장 및 전송 시
            암호화하여 사용하는 등의 별도 보안기능을 사용
          </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item eventKey="2">
          <Accordion.Header>청소년보호정책</Accordion.Header>
          <Accordion.Body>
            디깅(이하 "회사"라고 함) 모든 연령대의 사용자가 자유롭게 이용 할 수
            있는 서비스로 유해 정보로부터 청소년을 보호하고 청소년이 안전한
            인터넷 사용을 돕기 위하여 정보통신망 이용촉진 및 정보보호 등에 관한
            법률 및 청소년보호법에 근거하여 아래와 같이 청소년 보호정책을 수립,
            시행하고 있습니다. 제 1조 (목표 및 기본 원칙) 청소년이
            정신적·신체적으로 유해한 환경으로부터 보호받고 유익한 환경을
            조성하도록 노력하며, 안전하게 인터넷을 이용할 수 있는 서비스를
            제공하기 위해 청소년보호정책을 명시하고 있습니다 제 2조
            (청소년접근제한 및 관리조치) 불법적이거나 청소년에게 유해한 키워드와
            상품에 대해서 금칙어 처리를 일반 검색을 포함한 각종 서비스에 확대
            적용하고 있으며, 불법적이거나 유해한 키워드가 포함된 게시글의 경우
            작성 단계에서 해당 게시글 게시 시 서비스 이용제한 등의 조치가
            이루어질 수 있음을 안내하고 있습니다. 또한, 불건전하고 유해한
            게시글을 모니터링하고 이용자로 부터 신고를 받아 청소년 유해정보가
            노출되지 않도록 예방 차원의 조치를 강구합니다. 제 3조 (업무 담당자
            교육 시행) 각 서비스 담당자들을 대상으로 청소년보호 관련 법령 및
            제재기준, 유해정보 발견시 대처방법, 위반사항 처리에 대한 보고절차
            등을 교육하고 있습니다. 제 4조 (전체 이용자들의 인식제고)
            서비스이용약관 등을 통하여 불건전한 행위를 할 경우 서비스 이용제한
            등의 조치를 받을 수 있음을 고지하고 있으며, 신종 유해정보가 발생했을
            경우 공지사항 또는 이메일을 통하여 이를 신속히 전파함으로써 청소년
            및 전체 이용자를 보호하고 있습니다. 또한, 각종 정보건전화 교육 및
            캠페인 등을 통해서 네티켓 의식 고취를 위하여 노력하고 있습니다.
          </Accordion.Body>
        </Accordion.Item>
      </Accordion>
    </div>
  );
}

export default Privacy;
